Repository: 12AwsomeMan34/SpongeDocs
Catalog: source/locale/*/LC_MESSAGES/faq.po
Languages: pt_pt

source: Frequently Asked Questions
pt_pt: Perguntas Frequentes

source: What is Sponge?
pt_pt: O que é o Sponge?

source: The purpose of the Sponge project is to provide a community-supported modding framework for Minecraft.
pt_pt: O propósito do projeto Sponge é providenciar uma framework de modding suportada pela comunidade para Minecraft.

source: Summary
pt_pt: Sumário

source: We want something easy to use.
pt_pt: Queremos algo simples de utilizar

source: Community-developed modding API. We invite any developer to help out.
pt_pt: Um API de modding desenvolvido pela comunidade. Convidamos todos os desenvolvedores a ajudar-nos.

source: Works with Forge mods.
pt_pt: Que funcione com os mods do Forge.

source: No need for client mods if only used on the server.
pt_pt: Que não precise de mods no cliente se só forem utilizados mods no servidor.

source: Can be used to write client mods.
pt_pt: Que possa ser utilizado para escrever mods de cliente.

source: Not tied to any platform:
pt_pt: Que não esteja ligado a nenhuma plataforma:

source: Can be used on a from-scratch server (i.e. Glowstone) - Planned & officially working with Glowstone team
pt_pt: Que possa ser utilizado num servidor feito do zero (Glowstone) - Planeado e feito em coordenação com a equipa Glowstone de forma oficial.

source: Can be used on top of Forge - Planned & and officially working with Forge team
pt_pt: Que possa ser implementado em cima do Forge - Planeado e feito em coordenação com a equipa do Forge de forma oficial.

source: Can be injected into Minecraft directly - Not planned yet (this is a larger undertaking and we prefer something usable sooner)
pt_pt: Que possa ser injetado no Minecraft diretamente - Ainda não planeado (este é um empreendimento grande e preferimos ter algo utilizável mais brevemente)

source: An extremely open project.
pt_pt: Um projeto extremamente aberto.

source: No legal issues, unlike the Bukkit project.
pt_pt: Sem problemas legais como so do Bukkit.

source: Bukkit plugins may run on Sponge without change due to efforts by the community.
pt_pt: Os plugins do Bukkit poderão correr no Sponge sem alterações devido a esforços da comunidade.

source: Keeping performance as a high priority during development.
pt_pt: Queremos manter a performance como uma prioridade de topo durante o desenvolvimento.

source: Lots of people involved with strong Java backgrounds and/or experience.
pt_pt: Muitas pessoas envolvidas com fortes conhecimentos e/ou experiência em Java.

source: For the User
pt_pt: Para o utilizador

source: Our ultimate goal is to create a modding API that is easy to use for owners of small servers for friends and family, owners of large servers, and everyone in between. In addition, we also plan to permit client modding.
pt_pt: Para o utilizador O nosso objetivo principal é criar um API de modding que seja de fácil utilização por donos de pequenos servidores para amigos ou família, donos de servidores enormes, e todos os casos intermédios. Para além disso, faz parte dos nossos planos permitir client modding.

source: Sponge mods should work across several different Minecraft versions without needing an update from the developer, which means that you don’t have to worry about all your mods breaking between each new major release of Minecraft (1.6, 1.7, 1.8, etc.)
pt_pt: Os mods do Sponge deverão funcionar em várias versões diferentes do Minecraft sem necessidade de um update por parte do desenvolvedor, o que significa que não terás de se preocupar com os seus mods deixarem de funcionar entre cada novo lançamento do Minecraft (1.6, 1.7, 1.8, etc.).

source: If Sponge is used on the server, players who join will not need Sponge or Forge installed on their game. You can use Sponge to make management of your server easier, by allowing you to protect areas, log what players (or even friends) do, add minigames, and so on.
pt_pt: Se o Sponge for utilizado no servidor, os jogadores que se juntem não vão precisar de ter o Sponge ou o Forge instalado nos seus jogos. Pode utilizar o Sponge para tornar a gestão do seu servidor mais simples, permitindo a proteção de áreas, registar o que jogadores (ou até amigos) fazem, adicionar minijogos, e assim por diante.

source: However, you will be able to use Sponge mods on the client too, including Sponge mods that are meant only to be used on the client.
pt_pt: No entanto, também poderá utilizar mods do Sponge no cliente, incluindo mods do Sponge que são desenhados para o lado do cliente somente.

source: Sponge will be separated into an “API” that modders will use to make mods and an “implementation” that is able to load these mods. The API won’t change much between MC versions, so modders will build against that, and the implementation loads the mods and makes them work.
pt_pt: O Sponge será separado em: um “API” que os modders vão usar para fazer mods, e uma “implementation” que terá a capacidade de correr esses mods. O API não vai mudar muito entre cada versão do Minecraft, por isso os modders vão desenvolver em cima disso, e a implementation carrega os mods e fá-los funcionar.

source: We want to start by writing an implementation for two platforms: - Sponge will run on Minecraft Forge, which is an existing Minecraft modding framework (that lacks a cross-version API). - Sponge will also run on Glowstone, which is an independent Minecraft server that was written from scratch. Later on, we may also explore other options.
pt_pt: Queremos começar por escrever uma *implementation* para duas plataformas: - O Sponge vai correr no Minecraft Forge, que é uma framework já existente de modding de Minecraft (à qual falta o API multiversão). - O Sponge também correrá no Glowstone, que é um servidor de Minecraft independente que foi feito de raiz. Mais tarde, poderemos explorar outras opções.

source: The reason why we have chosen Forge and Glowstone as our initial base is because they are well established projects, reducing our time to release, while making use of work that has already been done by the community.
pt_pt: A razão pela qual escolhemos o Forge e o Glowstone como ponto de partida é porque estes são projetos bem estabelecidos, reduzindo o tempo de espera para o lançamento, e fazendo uso do trabalho que já foi desenvolvido pela comunidade.

source: Sponge is not tied to any particular platform, be it Forge or Glowstone.
pt_pt: O Sponge não está ligado a qualquer plataforma em particular, seja o Forge ou o Glowstone.

source: When/if Mojang releases their own modding API, it will be possible to build the Sponge API on top of Mojang’s modding API so that your Sponge mods continue to work.
pt_pt: Quando/se a Mojang lançar o seu próprio API de modding, será possível construir o API do Sponge em cima do API de modding da Mojang para que os teus plugins Sponge continuem a funcionar.

source: Sponge will support official interoperability with Forge so you can use both Sponge mods and Forge mods together. We are working directly with the Forge team.
pt_pt: O Sponge suportará interoperabilidade com o Forge para que possas usar os mods do Sponge e do Forge ao mesmo tempo. Estamos a trabalhar diretamente com a equipa Forge.

source: While Sponge will not be directly supporting Bukkit, community projects have been started that aim to provide complete support for existing Bukkit plugins on top of Sponge.
pt_pt: Apesar de o Sponge não estar diretamente a suportar o Bukkit, projetos da comunidade foram instaurados que têm como objetivo providenciar suporte aos plugins do Bukkit no Sponge.

source: For Bukkit Plugin Developers
pt_pt: Para desenvolvedores de plugins Bukkit

source: Sponge should be as easy to develop in as with Bukkit.
pt_pt: O desenvolvimento com o Sponge deverá ser tão fácil como com o Bukkit.

source: You will also be able to access something like “NMS” as well, however, this will be discouraged unless you are also writing a Forge mod. If you need something that the Sponge API does not provide, we plan to be a lot more open about accepting (well-written) implementations of well-requested features so that you don’t have to rely on hacky code.
pt_pt: Poderá aceder a algo como “NMS” como dantes, no entanto, isto não será encorajado a menos que também esteja a escrever um mod do Forge. Se precisar de alguma coisa que o API do Sponge não tenha, planeamos ser muito mais abertos em aceitar implementações (bem escritas) de funcionalidades pedidas com ciso para que não tenha de depender de código estranho.

source: If/when the Mojang modding API comes out, we will build the Sponge API on top of Mojang’s API so your plugins/mods continue to work with minimal changes.
pt_pt: e/quando o API de modding da Mojang sair, vamos construir o API do Sponge em cima do API da Mojang para que os seus mods/plugins continuem a funcionar sem grandes modificações.

source: For Forge Mod Developers
pt_pt: Para desenvolvedores de mods do Forge

source: The purpose of Sponge is to make an API that doesn’t change much between MC versions. It will be possible to write mods that use both Forge and Sponge.
pt_pt: O propósito do Sponge é fazer um API que não mude muito entre as versões do Minecraft. Será possível escrever mods que utilizem tanto o Sponge como o Forge.

source: Management of the Project
pt_pt: Gestão do projeto

source: As some of the older members of the community are aware, the demise of Bukkit would not be the first instance that the demise of a large modding platform has occurred in Minecraft. We’re aware of this and we’re planning for future scenarios.
pt_pt: Como alguns dos membros mais antigos sabem, a morte do Bukkit não foi a primeira vez que uma grande plataforma de modding ruiu no mundo de Minecraft. Estamos cientes disto e estamos a fazer planos para cenários futuros.

source: hMod died because its developer disappeared for an extended amount of time but provided no ability for hMod’s other developers to publish official releases. In addition, hMod did not have an API and suffered from technical problems.
pt_pt: O hMod morreu porque o seu desenvolvedor desapareceu por um grande período de tempo mas não deixou aos restantes desenvolvedores uma forma de publicarem as versões oficiais. Para além disso, o hMod não tinha um API e sofria de problemas técnicos.

source: To solve the problem with one single leader possibly disappearing from Earth, the project is currently led by two people: blood and sk89q. In addition, we are making sure to be open with the team so that we do not end up “holding all the keys.”
pt_pt: Para resolver o problema de um único líder desaparecer da face da Terra, o Sponge é liderado por duas pessoas neste momento, o blood e o sk89q. Por outro lado, estamos a certificarmo-nos de que somos abertos para com a equipa por forma a não acabarmos com “as chaves todas nas nossas mãos.”

source: As for the technical problems, we have chosen to write an API rather than simply modify Minecraft and add a mod loader.
pt_pt: Quanto aos problemas técnicos, decidimos escrever um API em vez de simplesmente moidicar o Minecraft e adicionar um carregador de mods.

source: Bukkit met its end because it was not open about decisions that it made, causing anger within the community, which then prompted one of Bukkit’s own developers to send a DMCA takedown notice to Bukkit, which was possible because Bukkit used an overly restrictive open source license with strict terms on how Bukkit could be used in conjunction with other software.
pt_pt: O Bukkit acabou porque não era aberto em relação às decisões que tomava, o que criou descontentamento na comunidade, que mais tarde levou um dos próprios desenvolvedores a enviar uma queixa à DMCA sobre o Bukkit, queixa esta que foi possível dado que o Bukkit usava uma licença de código aberto muito restritiva com termos muito limitativos sobre como o Bukkit podia ser utilizado em conjunto com outros softwares.

source: We are trying to be open as possible. Our GitHub repository has been available since the first day development began and we make weekly, lengthy announcements detailing the progress and future of the project. Our developers and leads interact with the community around the Internet and on the Sponge forums. You will find that we are very approachable: if you have an idea or issue we are all open ears.
pt_pt: Estamos a tentar ser tão abetos quanto possível. O nosso repositório GitHub tem estado disponível desde o primeiro dia de desenvolvimento e fazemos anúncios semanais e bem detalhados sobre o progresso e futuro do projeto. Os nossos desenvolvedores e líderes interagem com a comunidade na Internet e nos fóruns do Sponge. Verá que somos muito acessíveis: se tiver alguma ideia somos todos ouvidos.

source: We are using MIT, an extremely permissive open source license. This means that, should the worst case scenario occur, it will be possible to reuse the Sponge API and start a new project without being encumbered by legal problems like with Bukkit. In addition, MIT is compatible with GPL should that ever become a problem.
pt_pt: Estamos a usar a licença MIT, de código aberto, que é extremamente permissiva. Isto significa que, caso aconteça o pior, será possível reutilizar o API do Sponge e iniciar um novo projeto sem burocracias nem problemas legais como como o Bukkit. Para além disso, a MIT é compatível com a licença GPL caso isso venha a ser um problema.

source: Sponge has a lot of help from the existing Minecraft community, but please take note that ultimately the project is led by two people who make the final decisions. This way, we can have a large number of people contribute and yet still avoid having “too many cooks spoiling the broth.”
pt_pt: O Sponge tem muita ajuda por parte da comunidade de Minecraft existente, mas por favor entenda que, no fim, o projeto é liderado por duas pessoas que fazem as decisões finais. Desta forma, podemos ter um grande número de pessoas a contribuir e ainda assim evitar ter “muitos cozinheiros a estragarem a sopa”.

source: From a Technical Perspective
pt_pt: De uma perspetiva técnica

source: Many of our developers have worked with Minecraft for years and know the ins and outs of its mechanics.
pt_pt: Muitos dos nossos desenvolvedores têm trabalhado com o Minecraft durante anos e conhecem bem os pormenores.

source: Our developers are well versed with Java. Many of us frequently work with “bytecode injection” and have for years, or even write mod loaders on the side.
pt_pt: Os nossos desenvolvedores são bem versados em Java. Muitos de nós trabalhamos frequentemente com “bytecode injection” e já desde há alguns anos, ou até escrevemos carregadores de mods.

source: Performance is on our mind. The Glowstone implementation may run the best, but we plan to make the necessary changes to Minecraft to improve its performance for anything built on top of Minecraft itself (which includes the Forge implementation), just as Bukkit and Spigot has done.
pt_pt: Temos a performance em mente. A implementação em Glowstone pode ser a melhor, mas planeamos fazer as modificações necessárias ao Minecraft para melhorar a sua performance para qualquer coisa construída em cima do próprio Minecraft (que inclui a implementação do Forge), como o Bukkit e o Spigot fizeram.

source: How Does It All Fit Together?
pt_pt: Como é que tudo se encaixa?

source: **Note**: As this is a simplification, the number of layers has no bearing on the performance of the actual implementation. When the game is actually run with the API, it collapses into two layers: plugins versus "modded Minecraft" / Glowstone.
pt_pt: Nota: Como isto se trata de uma simplificação, o número de camadas não tem qualquer relação com a performance da implementação. Quando o jogo estiver a correr com o API, fica tudo condensado em duas camadas: os plugins e o “Minecraft modificado”/Glowstone.

source: What is Sponge Building?
pt_pt: O que é que o Sponge constrói?

source: How Do We Keep Plugins/Mods From Breaking Between MC Versions?
pt_pt: Como é que impedimos que os plugins deixem de funcionar entre versões?

source: How Much is Open Source?
pt_pt: Quanto disto é que é Open Source?

source: **Note**: Glowstone is only a server and not the full game itself.
pt_pt: **Nota**: O Glowstone é só um servidor, não o jogo.

source: How Did Bukkit Work?
pt_pt: Como é que o Bukkit funcionava?

source: **Note**: Bukkit came as one download, even though there are multiple underlying parts. That will be the same case with Sponge, and we will make it easy to run Sponge.
pt_pt: **Nota**: O Bukkit, apesar de composto por várias partes, vinha como um único ficheiro. Com o Sponge vai ser igual, queremos que seja fácil utilizar o Sponge.

source: What About Forge Mods and hMod Plugins?
pt_pt: Então e em relação aos mods do Forge e aos plugins do hMod?

source: General Questions
pt_pt: Questões gerais

source: When Will the First Downloads Be Available?
pt_pt: Quando é que os primeiros downloads vão estar disponíveis?

source: The release date of the Sponge implementation is still to be announced. However, the Sponge API (v1.0) was released on November 30th, 2014.
pt_pt: A data de lançamento da *Sponge implementation* ainda está para ser anunciada. No entanto, o *Sponge API (v1.0)* foi lançado a 30 de novembro de 2014.

source: Will There Be an Official Place to Download Plugins?
pt_pt: Vai haver uma página oficial para descarregar plugins?

source: Yes there will be. The complete details are still being discussed. You can take part of the discussion here https://forums.spongepowered.org/t/plugin-hosting/1150.
pt_pt: Sim, vai haver. Os detalhes estão a ser discutidos. Pode fazer parte desta discussão aqui https://forums.spongepowered.org/t/plugin-hosting/1150.

source: What Does This Mean for the Players?
pt_pt: O que é que isto significa para os jogadores?

source: Players should not notice anything different about the servers you know and love. Sponge is just an API that allows developers to create plugins just like before when using bukkit.
pt_pt: Os jogadores não deverão aperceber-se de qualquer diferença nos servidores que tanto amam. O Sponge é só um API que permite que desenvolvedores criem plugins tal como dantes com o Bukkit.

source: Will I Need Forge to Connect to a Sponge server?
pt_pt: Vou precisar do Forge para me ligar a um servidor Sponge?

source: No modification to your client is needed, just launch and play like normal!
pt_pt: Não será necessária nenhuma modificação ao cliente, é abrir o jogo e jogar normalmente!

source: What are Sponge Mods?
pt_pt: O que são *Sponge Mods*?

source: Sponge coremod is still under development, and will implement the Sponge API on a 1.8 Minecraft-Forge server. Future plans may include more client Sponge mods that could perform a variety of functions related to the client.
pt_pt: O *Sponge coremod* ainda está em desenvolvimento, e implementará o Sponge API num servidor Minecraft-Forge 1.8. Planos futuros poderão incluir mais mods de cliente do Sponge que realizem uma série de funções relativamente ao cliente.

source: What Does This Mean for the Server Owners?
pt_pt: O que é que isto significa para os Donos dos servidores?

source: Server owners will have to download Sponge and start them like any other Minecraft Forge server.
pt_pt: Os Donos dos Servidores terão de descarregar o Sponge e iniciá-lo como outro servidor Minecraft-Forge qualquer.

source: What Java Version is Sponge Using?
pt_pt: Que versão do Java é que o Sponge utiliza?

source: Sponge will be using Java 1.6, which is the minimum version supported by vanilla Minecraft and Forge.
pt_pt: O Sponge vai utilizar o Java 1.6, que é a versão mínima suportada pelo Minecraft Vanilla e pelo Forge.

source: Will Players Need the Forge Client to Connect?
pt_pt: Os Jogadores vão precisar do cliente Forge para se ligarem ao servidor?

source: What Minecraft Version is Sponge be First Available for?
pt_pt: Para que versão do Minecraft é que o Sponge vai começar a oferecer suporte?

source: Sponge will be first available for Minecraft 1.8, or whatever 1.8.x version exists at the time.
pt_pt: O Sponge vai estar primeiramente disponível para o Minecraft 1.8, ou para a versão 1.8.x que existir aquando do lançamento.

source: But Forge Doesn’t Support Unmodified Vanilla Clients?
pt_pt: Mas o Forge não suporta clientes vanilla não modificados?

source: It does now. Forge's lead developer LexManos has delivered on plans to add support for vanilla clients in the 1.8 update.
pt_pt: Agora sim. O desenvolvedor líder do Forge, o LexManos, concretizou os seus planos de adicionar suporte para clientes vanilla na versão 1.8.

source: But Forge Takes Too Long to Update?
pt_pt: Mas o Forge demora muito tempo a ser atualizado?

source: With a large portion of the Minecraft community working together, we are sure we can help speed up things. Development builds for Minecraft Forge are already available for the 1.8 update.
pt_pt: Com um boa parte da comunidade de MC a trabalhar junta, temos a certeza de que conseguimos acelerar as coisas. Já estão disponíveis *Development Builds* para o Minecraft-Forge do update 1.8.

source: I Haven't Kept Up, What Happened To Bukkit?
pt_pt: Não tenho acompanhado, o que é que aconteceu ao Bukkit?

source: One of the contributors to Bukkit sent a DMCA take down notice to have Bukkit removed. He was within his legal right. Downloads, as well as source code, for Bukkit and its derivatives (Spigot, Cauldron) are no longer available.
pt_pt: Um dos contribuidores do Bukkit enviou um pedido à DMCA para remover o Bukkit. Estava no seu direito legal. As descargas, bem como o código-fonte, do Bukkit e dos seus derivados (Spigot, Cauldron) já não estão disponíveis.

source: Who is Involved With the Sponge Project?
pt_pt: Quem está envolvido com o projeto Sponge?

source: blood (of MCPC+/Cauldron) - project lead
pt_pt: blood (do MCPC+/Cauldron) - Liderança do projeto

source: LexManos (of Forge/FML/MCP)
pt_pt: LexManos (do Forge/FML/MCP)

source: Portions of the Spout team: Zidane, Raphfrk, DDoS, Sleaker, Owexz, Wulfspider
pt_pt: Algumas pessoas da *Spout team*: Zidane, Raphfrk, DDoS, Sleaker, Owexz, Wulfspider

source: Portions of the Flow team: kitskub
pt_pt: Algumas pessoas da *Flow team*: kitskub

source: Portions from ForgeEssentials: AbrarSyed
pt_pt: Algumas pessoas do *ForgeEssentials*: AbrarSyed

source: Other Bukkit Plugin developers: KHobbits, Elgarl, zml
pt_pt: Outros desenvolvedores de plugins do Bukkit: KHobbits, Elgarl, zml

source: Portions of the FTB team: progwml6
pt_pt: Algumas pessoas da *FTB team*: progwml6

source: Some previous contributors to Bukkit
pt_pt: Algumas pessoas que já contribuíram para o Bukkit

source: Other people we have likely failed to mention
pt_pt: Outras pessoas cujo nome nos esquecemos de referir provavelmente

source: However, we are interested in talking with anyone who is able to help.
pt_pt: De qualquer forma estamos interessados em falar com qualquer pessoa capaz de ajudar.

source: How Are Decisions Made?
pt_pt: Como é que as decisões são tomadas?

source: The project owners, **blood** and **sk89q**, after consulting with the community and other members when appropriate, will make the decisions.
pt_pt: Os Donos do projeto, **blood** e **sk89q**, depois de consultarem a comunidade e outros membros, quando apropriado, tomarão as decisões.
