Repository: 12AwsomeMan34/SpongeDocs
Catalog: source/locale/*/LC_MESSAGES/devs/forge/contributing.po
Languages: de

source: Working on the Forge Mod
de: Arbeiten an der Forge Modifikation

source: Prerequisites
de: Vorraussetzungen

source: The setup required to develop plugins for Sponge is quite simple and requires three things.
de: Die Einrichtung, die benötigt wird um Plugins für Sponge zu programmieren, ist sehr einfach und benötigt drei Sachen.

source: Java JDK installed
de: Java JDK intalliert

source: Editor of your choice installed
de: Textbearbeitungsprogramm deiner Wahl installiert.

source: git client installed
de: git Anwendung installiert

source: Java JDK download
de: Java JDK runterladen

source: Download the JDK from Oracle first.
de: Lade zuerst das JDK von Oracle herunter.

source: We recommended that you first check that you only have one version of Java installed at any point in time. Please begin by uninstalling any old versions of Java you may have acquired in the past.
de: Wir empfehlen, dass du erst überprüft ob du nur eine Version von Java installiert hast. Wenn das nicht so ist, bitte deinstalliere alle ältere Java Versionen.

source: Then visit this site: http://www.oracle.com/technetwork/java/javase/downloads/index.html
de: Dann besuche die Website: http://www.oracle.com/technetwork/java/javase/downloads/index.html

source: Download and install the Java JDK. It's the upper blue button on the right-hand side of the main column.
de: Downloade und installiere das Java JDK. Es ist der obere rechte Knopf auf der rechten Seite des Textes.

source: If you cannot find it, try this link for a direct Java 7 JDK download: http://www.oracle.com/technetwork/java/javase/downloads/jdk7-downloads-1880260.html
de: Wenn du den Download nicht finden kannst versuche diesen direkten Link für das Java 7 JDK: http://www.oracle.com/technetwork/java/javase/downloads/jdk7-downloads-1880260.html

source: Make sure you install the JDK, not the JRE. The JDK, or Java Development Kit, contains crucial tools for creating Java applications.
de: Sei sicher dass du das JDK installierst und nicht die JRE. Die JDK enthält wichtige Anwendungen um Java Programme zu erstellen.

source: Let that install, then reboot your PC.
de: Warte bis die Installation abgeschlossen ist und starte dann den PC neu.

source: IDE Download
de: Programmierumgebung runterladen

source: The second main download you need to perform is getting your IDE (Interactive Development Environment).
de: Der zweite wichtige Download ist deine Programmierumgebung.

source: There are two commercially available IDEs that we provide instructions for; Eclipse, and IntelliJ IDEA. Which one you choose is a matter of personal preference, and you might even prefer an IDE that isn't listed here. That's up to you.
de: Es gibt zwei kommerzielle verfügbare Programmierumgebungen für welche wir Anleitungen haben; Eclipse und IntelliJ IDEA. Welches du verwenden möchtest hängt von deinen persönlichen Vorlieben hat und vielleicht magst du sogar eine andere Umgebung besser, die hier nicht aufgeführt ist. Das ist deine Eigene Entscheidung.

source: You can download Eclipse here: https://eclipse.org/downloads/ (Choose "Eclipse IDE for Java Developers")
de: Du kannst Eclipse hier runterladen: https://eclipse.org/downloads/ (Wähle "Eclipse IDE for Java Developers")

source: You can download IntelliJ IDEA here: https://www.jetbrains.com/idea/download/ (Choose the "Community Version" unless you want to pay for the Ultimate Edition. You do not need the Ultimate Edition to develop plugins, as the Community Version still contains all the tools you need.)
de: Du kannst das IntelliJ IDEA hier runterladen: https://www.jetbrains.com/idea/download/ (Wähle die"Community Version" außer du willst für die "Ultimate Edition" bezahlen. Du brauchst nicht die "Ultimate Edition" um Plugins zu programmieren, die "Community Version" enthält alle Features die du benötigst.)

source: git Download
de: git runterladen

source: The download page for git is here: http://git-scm.com/downloads
de: Die Seite um git runterzuladen ist hier: http://git-scm.com/downloads

source: Make sure to install the appropriate version for your operating system.
de: Gehe sicher, dass du die empfohlene Version für dein Betriebssystem installierst.

source: Linux users, git will be available on your distro's package manager, usually under the name "git".
de: Linux Besitzer, git sollte in eurem Paket Manager verfügbar sein. Normalerweise unter dem Namen "git".

source: Install it like any other application, and reboot.
de: Installiere es wie jede andere Anwendung und starte den Computer neu.

source: Running Gradle
de: Starte Gradle

source: Once these are downloaded, installed, and you've rebooted (again), then you can begin to setup the workspace specific for Sponge.
de: Wenn du alle Programme runtergeladen, installiert und neugestartet hast(mal wieder), kannst du mit den erstellen des Arbeitsplatzes für Sponge.

source: (We're going to assume that your `PATH` is correct as well, each operating system has its own way of specifying new directories to search for commands. In Unix-based systems the environment variable is `$PATH`. In Windows systems it is `%PATH%`%. It's advised to construct your profile in your system such that when you login to the computer, the `PATH` is setup correctly vs. manually updating the `PATH` before working with Sponge)
de: (Wir werden empfehlen dass die "PATH" Variable richtig ist. Jedes Betriebssystem hat seinen eigenen Weg um die Verzeichnisse für die suche nach Ausführbaren Dateien. In auf Unix basierend Systemen ist dies die "$PATH" System variable. In Windows System die "%PATH%". Wir empfehlen dass dein Betriebs System die "PATH" Variable richtig setzt wenn du dich einloggst als wenn du die "PATH" Variable jedes mal vor den Arbeiten mit Sponge manuell einstellst.)

source: To get Sponge and built, now we need to use `git` and the tools we just downloaded:
de: Um Sponge runterzuladen und zu kompelieren brauchen wir nun "git" sowie die Programme die wir soeben runtergeladen haben.

source: Before we begin with that, a few words of advice:
de: Bevor wir anfange, noch ein paar Hinweise:

source: Spaces in filenames are not ideal. Please do not use whitespace in filenames. As such, putting your repository into say, the Desktop, or in folders that contain whitespace filenames is a bad idea.
de: Lehrzeichen in Dateinamen sind nicht optimal. Bitte verwende keine Lehrzeichen in Dateinamen. Es ist eine schlechte idee deine Repository an stellen Orten zu speichern die Lehrzeichen erhalten.

source: Keep the paths to your source tree as short as possible::
de: Halte den Pfad zu deinen Code Verzeichnis so kurz wie möglich.

source: Caveat - some users may prefer to hold their source trees in their user folders, or elsewhere on the system. It's not required to keep the paths short, but it may help. If you do not prefer to put things close to the root folder, then put the file tree anywhere you like. It is up to you. Be aware of path name length limits of your Operating System
de: Einspruch - Einige Benutzer möchten lieber ihr Code Verzeichnis in ihren Benutzer Ordner oder anderswo haben. Es ist nicht nötig den Pfad so kurz wie möglich zu halten aber es wird vielleicht helfen. Wenn du es nicht magst das Code Verzeichnis nah an deinem Haupt Ordner zu haben dann speichere es halt woanders. Es ist deine Entscheidung. Sei aber gewarnt das manche Betriebssysteme ein Limit bei der Länge des Pfades haben.

source: Now you're ready to begin the process of getting Sponge sources and beginning to build it for the first time. Refer to the README.md page for the Sponge project for the most current version of instructions, but these steps are generally going to be the same throughout the development of Sponge::
de: Nun bist du bereit den Sponge Code runterzuladen und das erste mal zu kompelieren. Siehe die README.md Seite des Sponge Projekts für die neuste Version der Anleitung aber diese Schritte werden hauptsächlich das gleiche sein für die ganze Zeit während der Entwicklung von Sponge.

source: That will create a clone of the Sponge project on your PC. The process will create the directory Sponge::
de: Das wird eine Kopie des Sponge Projektes auf deinen PC erstellen. Unter dem Ordner Sponge:

source: We need to update the project by fetching the submodules linked to Sponge, namely the SpongeAPI module::
de: Wir müssen das Projekt aktualisieren indem wir ein Untermodul runterladen das mit Sponge verbunden ist, das Sponge API Modul.

source: There is a commit-hook that is used to process checkins to the repository, we need to put a copy of that hook in the `git` hooks folder::
de: Es gibt einen "commit-hook" der Verwendet wird um das ganze upzudaten, wir müssen eine Kopie dessen in den "hooks" Ordner von "git" kopieren.

source: (With Unix-based systems the command is just the same, but using cp and the path separators are /)::
de: (In auf Unix-basierenden Systemen ist der Befehl fast der selbe, außer dass man "cp" verwenden muss und die Zeichen im Pfad "/" sind.)

source: At this point you can begin to setup the workspace with gradle (which you do NOT need to download or install)
de: An diesen Punkt können wir anfangen unsere Arbeitsumgebung mit gradle aufzubauen(dieses brauchen wir NICHT runterzuladen oder zu installieren)

source: The catch is that the gradle build process needs to be aware of the location of your Java compiler. So before running gradle for the first time to setup the workspace, we need to specify the environment variable ``JAVA_HOME``.
de: Wichtig ist, dass der gradle Erstellung Prozess wissen muss wo der Java Kompilierer ist. Also müssen wir bevor wir gradle das erste mal ausführen erstmal die Umgebungsvariable "JAVA_HOME" setzen.

source: ``JAVA_HOME`` is an environment variable that is set in the shell. You can set this up once in your login process for your PC or manually set it each time you run gradle. I prefer to put it into my per-login process so I don't need to manually set it.
de: "JAVA_HOME" ist eine Umgebungs Variable, welche in der Konsole gesetzt ist. Du kannst sie automatisch beim Anmelde Prozess setzen lassen oder manuell setzen jedes mal wenn du gradle benutzen möchtest. Ich bevorzuge es diese in mein Anmeldung Prozess zu setzen, da ich sie so nicht immer wieder von Hand setzen muss.

source: ``JAVA_HOME`` is a directory to where the JDK is installed:
de: "JAVA_HOME" ist eine Verlinkung zu den Ordner wo das JDK installiert ist.

source: If you installed Java as shown above then the JAVA_HOME would be set like this::
de: Wenn du Java wie oben beschrieben installiert hast, würde dein Java_Home wie folgt gesetzt werden:

source: (jdk1.7.0.67 is the version I have at the moment, your version will differ if the download is recent)
de: (jdk1.7.0.67 ist die Version die ich im Moment habe, deine Version wird unterschiedlich sein, wenn dein Download neuer ist)

source: To see exactly what the version (path) is then just type::
de: Um genau zu sehen was die Version(Pfad) ist, gebe folgendes in die Konsole ein:

source: and inspect the output for the name of the directory that contains the JDK.
de: und schaue in der Ausgabe nach dem namen des Ordners, welcher dein JDK enthätl.

source: Once JAVA_HOME is set then we can run gradle to setup the workspace:
de: Wenn JAVA_HOME einmal gesetzt ist, können wir gradle ausführen um die Arbeitsumgebung zu erstellen.

source: This process will do several things:
de: Dieser Prozess wird verschiedene Sachen machen:

source: It will download jar files that are required for Sponge to build. It will download Forge which is required for Sponge to build.
de: Er wird die jar Datein runterladen die Sponge benötigt um erstellt zu werden. Er wird unter anderem Forge runterladen.

source: (remember we're building Sponge, not plugins for Sponge)
de: (kleine Erinnerung, wir erstellen Sponge, keine Plugins für Sponge)

source: Sponge plugins DO NOT need Forge to build (nor should they ever need Forge to build).
de: Sponge Plugins BRAUCHEN KEIN Forge um erstellt zu werden(weder sollten sie es jemals benötigen)

source: This process will take a few minutes depending on your network connection. It is a process that requires a network connection so be sure you are online for that step.
de: Dieser Prozess wird eine minuten benötigen, variieren nach deiner Internet Verbindung. Dieser Prozess benötigt eine Interneit Verbindung, sei also sicher dass du für diesen Schrit verbunden bist.

source: At this point the output will end with a message like this::
de: An diesen Punkt sollte die Ausgabe mit einer Nachricht wie diese enden:

source: Next Steps
de: Nächste Schritte

source: From here you should follow the steps on the SpongePowered/Sponge README.md file to configure your IDE (Eclipse or IntelliJ) to import the Sponge Project and build/run the Sponge Artifact within the IDE.
de: Von hier an solltest du die Schritte in der SpongePowered/Sponge README.md Datei befolgen um deine Programmierumgebung(Eclipse oder InteliJ) konfigurieren und die Sponge Daten zu importieren.

source: The next wiki article on :doc:`debugging` will explain how to setup your IDE to start, run and debug Sponge within the IDE.
de: Der nächste Artikel auf :doc:`debugging` wird dir erklären wie du deine Programmierumgebung einstellst Sponge zu starten und Debuggen.
